---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcBuildingGuid
source: html/9cd0277b-a015-ac2e-0a5c-3b5768fa9223.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcBuildingGuid Property

"IfcBuilding GUID"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcBuildingGuid { get; }
```